/*
    Compile unit: C:\SB\Core\x\xMath2.cpp
    Producer: MW MIPS C Compiler
    Language: C++
*/
class xVec2 g_O2; // size: 0x8, address: 0x0
class xVec2 g_X2; // size: 0x8, address: 0x0
class xVec2 g_Y2; // size: 0x8, address: 0x0
class _xMat3x2 g_I2; // size: 0x18, address: 0x0
class basic_rect m_Null; // size: 0x10, address: 0x4F8D50
class basic_rect m_Unit; // size: 0x10, address: 0x4F8D60
class xVec2 {
    // total size: 0x8
public:
    float x; // offset 0x0, size 0x4
    float y; // offset 0x4, size 0x4
};
class basic_rect {
    // total size: 0x10
public:
    float x; // offset 0x0, size 0x4
    float y; // offset 0x4, size 0x4
    float w; // offset 0x8, size 0x4
    float h; // offset 0xC, size 0x4
};
class _xMat3x2 {
    // total size: 0x18
public:
    class xVec2 right; // offset 0x0, size 0x8
    class xVec2 up; // offset 0x8, size 0x8
    class xVec2 pos; // offset 0x10, size 0x8
};

