#include "stdio.h"
#include <string.h>

#include "zCamera.h"
#include "zEntButton.h"
#include "zEntCruiseBubble.h"
#include "zEntDestructObj.h"
#include "zEntPlayer.h"
#include "zEntTrigger.h"
#include "zGameExtras.h"
#include "zGlobals.h"
#include "zTalkBox.h"

#include "../Core/x/xColor.h"
#include "../Core/x/xDecal.h"
#include "../Core/x/xFX.h"
#include "../Core/x/xMath.h"
#include "../Core/x/xMathInlines.h"
#include "../Core/x/xMath3.h"
#include "../Core/x/xModel.h"
#include "../Core/x/xSnd.h"
#include "../Core/x/xString.h"
#include "../Core/x/xstransvc.h"
#include "../Core/x/xVec3.h"
#include "zNPCTypeCommon.h"
#include "zPlatform.h"

namespace cruise_bubble
{

extern basic_rect<float32> screen_bounds;
// basic_rect default_adjust;
// int8 buffer[16];
// int8 buffer[16];
extern tweak_group normal_tweak;
extern tweak_group cheat_tweak;
extern tweak_group* current_tweak;
extern xBase base;
extern const char* start_anim_states[37]; // string array of names

extern struct _class_36
{
    int32 flags;
    state_type* state[3];
    // Offset: 0x10
    state_type* states[12];
    // Offset: 0x40
    xVec2 last_sp;
    // Offset: 0x48
    xVec2 sp;
    // Offset: 0x50
    xVec3 hit_loc;
    // Offset: 0x5c
    xVec3 hit_norm;
    // Offset: 0x68
    xModelInstance* missle_model;
    // Offset: 0x6c
    xEnt* hits[32];
    // Offset: 0xec
    int32 hits_size;
    uint32 player_health;
    xVec3 player_motion;
    float32 fov_default;
    zShrapnelAsset* droplet_shrapnel;
    float32 dialog_freq;
    struct _class_45
    {
        float32 samples;
        float32 bubbles;
        xMat4x3 mat;
        xQuat dir;
    } trail;
    struct _class_6
    {
        struct _class_8
        {
            xAnimState* aim;
            xAnimState* fire;
            xAnimState* idle;
        } player;
        struct _class_16
        {
            xAnimState* fire;
            xAnimState* fly;
        } missle;
    } astate;
    struct _class_25
    {
        struct _class_28
        {
            xAnimTransition* aim;
            xAnimTransition* fire;
            xAnimTransition* idle;
            xAnimTransition* end;
        } player;
        struct _class_33
        {
            xAnimTransition* fly;
        } missle;
    } atran;
} shared;
// xMat4x3 start_cam_mat;
// fixed_queue missle_record;
extern xFXRibbon wake_ribbon[2];
extern xDecalEmitter explode_decal;
extern const xFXRibbon::curve_node wake_ribbon_curve[2];
extern const xFXRibbon::curve_node cheat_wake_ribbon_curve[2];
extern const xDecalEmitter::curve_node explode_curve[3];
extern const xDecalEmitter::curve_node cheat_explode_curve[3];
extern sound_config sounds[4];
// quadrant_set qzone;

extern struct _class_17
{
    bool hiding;
    float32 alpha;
    float32 alpha_vel;
    float32 glow;
    float32 glow_vel;

    // Offset 0x14
    struct _class_21
    {
        xModelInstance* reticle;
        xModelInstance* target;
        xModelInstance* swirl;
        xModelInstance* wind;
    } model;
    // Offset 0x24
    hud_gizmo gizmo[33];
    // Offset 0x654
    uint32 gizmos_used;
    // Offset 0x658
    uv_animated_model uv_swirl;
    // Offset 0x674
    uv_animated_model uv_wind;
} hud;
// void (*xAnimDefaultBeforeEnter)(xAnimPlay*, xAnimState*);
// uint32 (*check_anim_aim)(xAnimTransition*, xAnimSingle*, void*);
// zGlobals globals;
// RpAtomic* (*AtomicDefaultRenderCallBack)(RpAtomic*);
// RpAtomic* (*custom_bubble_render)(RpAtomic*);
// iColor_tag g_WHITE;
// uint32 gActiveHeap;
// _anon0 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @20state_camera_restore;
// _anon5 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @10state_type;
// _anon6 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @19state_camera_survey;
// _anon1 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @19state_camera_attach;
// _anon9 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @18state_camera_seize;
// _anon10 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @16state_camera_aim;
// _anon3 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @20state_missle_explode;
// _anon7 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @16state_missle_fly;
// _anon2 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @19state_missle_appear;
// _anon4 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @17state_player_wait;
// _anon8 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @17state_player_fire;
// _anon11 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @16state_player_aim;
// _anon12 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @17state_player_halt;
// RpAtomic* (*gAtomicRenderCallBack)(RpAtomic*);
// uint32 gFXSurfaceFlags;
// xVec3 m_UnitAxisY;
// xGrid npcs_grid;
// xGrid colls_oso_grid;
// xGrid colls_grid;
// uint8 (*hazard_check)(NPCHazard&, void*);
// xQCControl xqc_def_ctrl;
// void (*SweptSphereHitsCameraEnt)(xScene*, xRay3*, xQCData*, xEnt*, void*);
// void (*cb_droplet)(zFrag*, zFragAsset*);
// uint8 (*hazard_check)(NPCHazard&, void*);
// uint8 (*hazard_check)(NPCHazard&, void*);
// int32 gGridIterActive;

extern const char stringBase0[]; // "Idle01\0Idle02\0Idle03\0Idle04\0Idle05\0Idle06\0Idle07\0Idle08\0Idle09\0Idle10\0Idle11\0Idle12\0Idle13\0SlipIdle01\0Inactive01\0Inactive02\0Inactive03\0Inactive04\0Inactive05\0Inactive06\0Inactive07\0Inactive08\0Inactive09\0Inactive10\0Walk01\0Run01\0Run02\0Run03\0Land01\0LandRun01\0LandHigh01\0WallLand01\0Hit01\0Hit02\0Hit03\0Hit04\0Hit05\0SB_cruise_start\0SB_cruise_hit\0SB_cruise_nav_loop\0cruise_bubble_bind.MINF\0lightning\0Wake Ribbon 0\0Player|Cruise Bubble|Wake Ribbon 0|\0Wake Ribbon 1\0Player|Cruise Bubble|Wake Ribbon 1|\0par_cruise_explode\0Cruise Bubble Explosion\0cruise_bubble_droplet_shrapnel\0.minf\0.dff\0ui_3dicon_reticle\0ui_3dicon_target_lock\0ui_3dicon_missile_frame02\0%02d:%02d\0aura2\0aim_delay\0player.halt_time\0player.aim.turn_speed\0player.aim.anim_delta\0player.fire.delay_wand\0missle.life\0missle.hit_dist\0missle.crash_angle\0missle.collide_twist\0missle.hit_tests\0missle.appear.delay_show\0missle.appear.delay_fly\0missle.appear.offset\0missle.fly.accel\0missle.fly.max_vel\0missle.fly.engine_pitch_max\0missle.fly.engine_pitch_sensitivity\0missle.fly.flash_interval\0missle.fly.turn.xdelta\0missle.fly.turn.ydelta\0missle.fly.turn.xdecay\0missle.fly.turn.ydecay\0missle.fly.turn.ybound\0missle.fly.turn.roll_frac\0missle.explode.hit_radius\0missle.explode.hit_duration\0camera.aim.dist\0camera.aim.height\0camera.aim.pitch\0camera.aim.accel\0camera.aim.max_vel\0camera.aim.stick_decel\0camera.aim.stick_accel\0camera.aim.stick_max_vel\0camera.aim.turn_speed\0camera.seize.delay\0camera.seize.blend_time\0camera.seize.fade_dist\0camera.seize.hide_dist\0camera.seize.fov\0camera.survey.duration\0camera.survey.min_duration\0camera.survey.min_dist\0camera.survey.cut_dist\0camera.survey.drift_dist\0camera.survey.drift_softness\0camera.survey.jerk_offset\0camera.survey.jerk_deflect\0camera.restore.control_delay\0material.env_alpha\0material.env_coeff\0material.fresnel_alpha\0material.fresnel_coeff\0reticle.dist_min\0reticle.dist_max\0reticle.ang_show\0reticle.ang_hide\0reticle.delay_retarget\0trail.sample_rate\0trail.bubble_rate\0trail.bubble_emit_radius\0trail.wake_emit_radius\0blast.emit\0blast.radius\0blast.vel\0blast.rand_vel\0droplet.dist_min\0droplet.dist_max\0droplet.emit_min\0droplet.emit_max\0droplet.vel_min\0droplet.vel_max\0droplet.vel_perturb\0droplet.vel_angle\0droplet.rot_vel_max\0hud.glow_size\0hud.time_fade\0hud.time_glow\0hud.wind.size\0hud.wind.du\0hud.wind.dv\0hud.reticle.size\0hud.target.size\0hud.timer.font\0hud.timer.font_width\0hud.timer.font_height\0hud.timer.x\0hud.timer.y\0hud.timer.glow_size\0dialog.freq\0dialog.decay\0dialog.min_freq\0gloss_edge\0rainbowfilm_smooth32\0cruise_bubble_aim\0cruise_bubble_fire\0cruise_bubble_idle\0cruise_bubble_aim cruise_bubble_fire cruise_bubble_idle\0Cruise Bubble\0fire\0fly\0\0\0\0"

} // namespace cruise_bubble

extern float32 zEntCruiseBubble_f_0_0; // 0.0
extern float32 zEntCruiseBubble_f_1_0; // 1.0
extern float32 zEntCruiseBubble_f_0_5; // 0.5
extern float32 zEntCruiseBubble_f_3_0; // 3.0
extern float32 zEntCruiseBubble_f_0_25; // 0.25
extern float32 zEntCruiseBubble_f_255_0; // 255.0
extern float32 zEntCruiseBubble_f_n1_0; // -1.0
extern float32 zEntCruiseBubble_f_100_0; // 100.0

extern iColor_tag zEntCruiseBubble_color_80_00_00_FF; // 128, 0, 0, 255
extern iColor_tag zEntCruiseBubble_color_FF_14_14_FF; // 255, 20, 20, 255

void cruise_bubble::init_sound()
{
    sound_config* s;
    sound_config* end = &sounds[4];
    for (s = &sounds[0]; s != end; ++s)
    {
        s->id = (s->name == 0) ? 0 : xStrHash(s->name);
        s->handle = 0;
    }
}

void cruise_bubble::stop_sound(int32 which, uint32 handle)
{
    sound_config* s = &sounds[which];

    if (s->id == 0)
    {
        if (s->streamed == 0)
        {
            for (int32 i = s->first; i <= s->last; ++i)
            {
                zEntPlayer_SNDStop((_tagePlayerSnd)i);
            }
        }
        return;
    }

    if (handle == 0)
    {
        handle = s->handle;
    }
    
    if (handle != 0)
    {
        xSndStop(handle);
    }

    s->handle = 0;
}

// func_80057320
// will match once file is complete, see comment below
#if 1
