#include <string.h>

#include "zCamera.h"
#include "zEntButton.h"
#include "zEntCruiseBubble.h"
#include "zEntDestructObj.h"
#include "zEntPlayer.h"
#include "zGlobals.h"
#include "zTalkBox.h"

#include "../Core/x/xFX.h"
#include "../Core/x/xMath.h"
#include "../Core/x/xMath3.h"
#include "../Core/x/xModel.h"
#include "../Core/x/xSnd.h"
#include "../Core/x/xString.h"
#include "../Core/x/xstransvc.h"
#include "../Core/x/xVec3.h"
#include "zNPCTypeCommon.h"
#include "zPlatform.h"

namespace cruise_bubble
{

// basic_rect screen_bounds;
// basic_rect default_adjust;
// int8 buffer[16];
// int8 buffer[16];
// tweak_group normal_tweak;
// tweak_group cheat_tweak;
// tweak_group* current_tweak;
extern xBase base;
extern const char* start_anim_states[37]; // string array of names

extern struct _class_36
{
    int32 flags;
    state_type* state[3];
    // Offset: 0x10
    state_type* states[12];
    // Offset: 0x40
    xVec2 last_sp;
    // Offset: 0x48
    xVec2 sp;
    // Offset: 0x50
    xVec3 hit_loc;
    // Offset: 0x5c
    xVec3 hit_norm;
    // Offset: 0x68
    xModelInstance* missle_model;
    // Offset: 0x6c
    xEnt* hits[32];
    // Offset: 0xec
    int32 hits_size;
    uint32 player_health;
    xVec3 player_motion;
    float32 fov_default;
    zShrapnelAsset* droplet_shrapnel;
    float32 dialog_freq;
    struct _class_45
    {
        float32 samples;
        float32 bubbles;
        xMat4x3 mat;
        xQuat dir;
    } trail;
    struct _class_6
    {
        struct _class_8
        {
            xAnimState* aim;
            xAnimState* fire;
            xAnimState* idle;
        } player;
        struct _class_16
        {
            xAnimState* fire;
            xAnimState* fly;
        } missle;
    } astate;
    struct _class_25
    {
        struct _class_28
        {
            xAnimTransition* aim;
            xAnimTransition* fire;
            xAnimTransition* idle;
            xAnimTransition* end;
        } player;
        struct _class_33
        {
            xAnimTransition* fly;
        } missle;
    } atran;
} shared;
// xMat4x3 start_cam_mat;
// fixed_queue missle_record;
