#include <PowerPC_EABI_Support\MSL_C\MSL_Common\cmath>
#include <rpskin.h>
#include <stdio.h>
#include <string.h>

#include "zCamera.h"
#include "zEnt.h"
#include "zEntButton.h"
#include "zEntCruiseBubble.h"
#include "zEntDestructObj.h"
#include "zEntPlayer.h"
#include "zEntTrigger.h"
#include "zGameExtras.h"
#include "zGlobals.h"
#include "zNPCHazard.h"
#include "zNPCTypeCommon.h"
#include "zPlatform.h"
#include "zRenderState.h"
#include "zTalkBox.h"

#include "iMath.h"

#include "xColor.h"
#include "xDecal.h"
#include "xFX.h"
#include "xGrid.h"
#include "xMath.h"
#include "xMath3.h"
#include "xMathInlines.h"
#include "xModel.h"
#include "xSnd.h"
#include "xstransvc.h"
#include "xString.h"
#include "xVec3.h"

basic_rect<F32> screen_bounds  = { 0.0f, 0.0f, 1.0f, 1.0f };
basic_rect<F32> default_adjust = { 0.0f, 0.0f, 1.0f, 1.0f };

extern iColor_tag zEntCruiseBubble_color_80_00_00_FF; // 128, 0, 0, 255
extern iColor_tag zEntCruiseBubble_color_FF_14_14_FF; // 255, 20, 20, 255

extern RpAtomic *(*gAtomicRenderCallBack)(RpAtomic*);

template <typename T>
void xGridCheckBound(xGrid& grid, const xBound& bound, const xQCData& qcd, T param);

namespace cruise_bubble
{
    namespace
    {
        tweak_group normal_tweak;
        tweak_group cheat_tweak;
        xMat4x3 start_cam_mat;

        const xDecalEmitter::curve_node explode_curve[3] =
        {
            { 0.0f, { 0xFF, 0xFF, 0xFF, 0xFF }, 0.1f },
            { 0.5f, { 0xFF, 0xFF, 0xFF, 0xFF }, 2.55f },
            { 1.0f, { 0xFF, 0xFF, 0xFF, 0x00 }, 5.0f },
        };

        const xDecalEmitter::curve_node cheat_explode_curve[3] =
        {
            { 0.0f, { 0xFF, 0xFF, 0xFF, 0xFF }, 0.1f },
            { 0.5f, { 0xFF, 0xFF, 0xFF, 0xFF }, 3.55f },
            { 1.0f, { 0xFF, 0xFF, 0xFF, 0x00 }, 7.0f },
        };

        fixed_queue<missle_record_data, 127> missle_record;
        tweak_group* current_tweak = &normal_tweak;

        xBase base = { 0, eBaseTypeCruiseBubble };

        const char* start_anim_states[37] =
        {
            "Idle01",
            "Idle02",
            "Idle03",
            "Idle04",
            "Idle05",
            "Idle06",
            "Idle07",
            "Idle08",
            "Idle09",
            "Idle10",
            "Idle11",
            "Idle12",
            "Idle13",
            "SlipIdle01",
            "Inactive01",
            "Inactive02",
            "Inactive03",
            "Inactive04",
            "Inactive05",
            "Inactive06",
            "Inactive07",
            "Inactive08",
            "Inactive09",
            "Inactive10",
            "Walk01",
            "Run01",
            "Run02",
            "Run03",
            "Land01",
            "LandRun01",
            "LandHigh01",
            "WallLand01",
            "Hit01",
            "Hit02",
            "Hit03",
            "Hit04",
            "Hit05"
        };

        xFXRibbon wake_ribbon[2];
        xDecalEmitter explode_decal;

        const xFXRibbon::curve_node wake_ribbon_curve[2] =
        {
            { 0.0f, { 0xFF, 0xFF, 0xFF, 0x64 }, 0.3f },
            { 1.0f, { 0x00, 0x00, 0x00, 0x00 }, 1.0f },
        };

        const xFXRibbon::curve_node cheat_wake_ribbon_curve[2] =
        {
            { 0.0f, { 0xFF, 0x9B, 0x9B, 0x64 }, 0.5f },
            { 1.0f, { 0x00, 0x00, 0x00, 0x00 }, 2.0f },
        };

        struct
        {
            bool hiding;
            F32 alpha;
            F32 alpha_vel;
            F32 glow;
            F32 glow_vel;

            // Offset 0x14
            struct
            {
                xModelInstance* reticle;
                xModelInstance* target;
                xModelInstance* swirl;
                xModelInstance* wind;
            } model;
            // Offset 0x24
            hud_gizmo gizmo[33];
            // Offset 0x654
            U32 gizmos_used;
            // Offset 0x658
            uv_animated_model uv_swirl;
            // Offset 0x674
            uv_animated_model uv_wind;
        } hud;

        struct
        {
            S32 flags;
            state_type* state[MAX_THREAD];
            // Offset: 0x10
            state_type* states[MAX_STATE];
            // Offset: 0x40
            xVec2 last_sp;
            // Offset: 0x48
            xVec2 sp;
            // Offset: 0x50
            xVec3 hit_loc;
            // Offset: 0x5c
            xVec3 hit_norm;
            // Offset: 0x68
            xModelInstance* missle_model;
            // Offset: 0x6c
            xEnt* hits[32];
            // Offset: 0xec
            S32 hits_size;
            U32 player_health;
            xVec3 player_motion;
            // Offset: 0x100
            F32 fov_default;
            zShrapnelAsset* droplet_shrapnel;
            F32 dialog_freq;
            struct
            {
                F32 samples;
                F32 bubbles;
                xMat4x3 mat;
                xQuat dir;
            } trail;
            struct
            {
                struct
                {
                    xAnimState* aim;
                    xAnimState* fire;
                    xAnimState* idle;
                } player;
                struct
                {
                    // Offset: 0x170
                    xAnimState* fire;
                    xAnimState* fly;
                } missle;
            } astate;
            struct
            {
                struct
                {
                    xAnimTransition* aim;
                    xAnimTransition* fire;
                    xAnimTransition* idle;
                    xAnimTransition* end;
                } player;
                struct
                {
                    xAnimTransition* fly;
                } missle;
            } atran;
        } shared =
        {
            1 // flags
        };

        sound_config sounds[4] =
        {
            { "SB_cruise_start",    1.0f, 5.0f,  20.0f, 0, 0, SDR_CruiseBubbleLaunch, 0, 0, 0, 0 },
            { "SB_cruise_hit",      1.0f, 15.0f, 60.0f, 0, 0, SDR_CruiseBubbleExplode, 0, 0, 0, 0 },
            { "SB_cruise_nav_loop", 1.0f, 0.0f,  10.0f, 0, 1, SDR_None, 0, 0, 0, 0 },
