#include "zNPCHazard.h"
#include <PowerPC_EABI_Support\MSL_C\MSL_Common\cmath>
#include <string.h>

#include "stdio.h"
#include "zEnt.h"
#include "zRenderState.h"

#include "zCamera.h"
#include "zEntButton.h"
#include "zEntCruiseBubble.h"
#include "zEntDestructObj.h"
#include "zEntPlayer.h"
#include "zEntTrigger.h"
#include "zGameExtras.h"
#include "zGlobals.h"
#include "zNPCTypeCommon.h"
#include "zPlatform.h"
#include "zTalkBox.h"

#include "iMath.h"
#include "xColor.h"
#include "xDecal.h"
#include "xFX.h"
#include "xMath.h"
#include "xMathInlines.h"
#include "xMath3.h"
#include "xModel.h"
#include "xSnd.h"
#include "xString.h"
#include "xstransvc.h"
#include "xVec3.h"

// Taken from zEntCruiseBubble.s
// Defining these here makes the stringBase0 offsets match in the later functions.
static char* str1 = "Idle01";
static char* str2 = "Idle02";
static char* str3 = "Idle03";
static char* str4 = "Idle04";
static char* str5 = "Idle05";
static char* str6 = "Idle06";
static char* str7 = "Idle07";
static char* str8 = "Idle08";
static char* str9 = "Idle09";
static char* str10 = "Idle10";
static char* str11 = "Idle11";
static char* str12 = "Idle12";
static char* str13 = "Idle13";
static char* str14 = "SlipIdle01";
static char* str15 = "Inactive01";
static char* str16 = "Inactive02";
static char* str17 = "Inactive03";
static char* str18 = "Inactive04";
static char* str19 = "Inactive05";
static char* str20 = "Inactive06";
static char* str21 = "Inactive07";

static char* str103 = "camera.survey.jerk_offset";
static char* str104 = "camera.survey.jerk_deflect";
static char* str105 = "camera.restore.control_delay";
static char* str106 = "material.env_alpha";
static char* str107 = "material.env_coeff";
static char* str108 = "material.fresnel_alpha";
static char* str109 = "material.fresnel_coeff";
static char* str110 = "reticle.dist_min";
static char* str111 = "reticle.dist_max";
static char* str112 = "reticle.ang_show";
static char* str113 = "reticle.ang_hide";
static char* str114 = "reticle.delay_retarget";
static char* str115 = "trail.sample_rate";
static char* str116 = "trail.bubble_rate";
static char* str117 = "trail.bubble_emit_radius";
static char* str118 = "trail.wake_emit_radius";
static char* str119 = "blast.emit";
static char* str120 = "blast.radius";
static char* str121 = "blast.vel";
static char* str122 = "blast.rand_vel";
static char* str123 = "droplet.dist_min";
static char* str124 = "droplet.dist_max";
static char* str125 = "droplet.emit_min";
static char* str126 = "droplet.emit_max";
static char* str127 = "droplet.vel_min";
static char* str128 = "droplet.vel_max";
static char* str129 = "droplet.vel_perturb";
static char* str130 = "droplet.vel_angle";
static char* str131 = "droplet.rot_vel_max";
static char* str132 = "hud.glow_size";
static char* str133 = "hud.time_fade";
static char* str134 = "hud.time_glow";
static char* str135 = "hud.wind.size";
static char* str136 = "hud.wind.du";
static char* str137 = "hud.wind.dv";
static char* str138 = "hud.reticle.size";
static char* str139 = "hud.target.size";
static char* str140 = "hud.timer.font";
static char* str141 = "hud.timer.font_width";
static char* str142 = "hud.timer.font_height";
static char* str143 = "hud.timer.x";
static char* str144 = "hud.timer.y";
static char* str145 = "hud.timer.glow_size";
static char* str146 = "dialog.freq";
static char* str147 = "dialog.decay";
static char* str148 = "dialog.min_freq";
static char* str149 = "gloss_edge";
static char* str150 = "rainbowfilm_smooth32";
static char* str151 = "cruise_bubble_aim";
static char* str152 = "cruise_bubble_fire";
static char* str153 = "cruise_bubble_idle";
static char* str154 = "cruise_bubble_aim cruise_bubble_fire cruise_bubble_idle";
static char* str155 = "Cruise Bubble";
static char* str156 = "fire";
static char* str157 = "fly";

namespace cruise_bubble
{
    extern basic_rect<F32> screen_bounds;
    // basic_rect default_adjust;
    // char buffer[16];
    // char buffer[16];
    extern const char* start_anim_states[37]; // string array of names

    extern fixed_queue<missle_record_data, 127> missle_record;
    extern xFXRibbon wake_ribbon[2];
    extern xDecalEmitter explode_decal;
    extern const xFXRibbon::curve_node wake_ribbon_curve[2];
    extern const xFXRibbon::curve_node cheat_wake_ribbon_curve[2];
    extern const xDecalEmitter::curve_node explode_curve[3];
    extern const xDecalEmitter::curve_node cheat_explode_curve[3];
    extern sound_config sounds[4];
    // quadrant_set qzone;

    extern struct _class_17
    {
        bool hiding;
        F32 alpha;
        F32 alpha_vel;
        F32 glow;
        F32 glow_vel;

        // Offset 0x14
        struct _class_21
        {
            xModelInstance* reticle;
            xModelInstance* target;
            xModelInstance* swirl;
            xModelInstance* wind;
        } model;
        // Offset 0x24
        hud_gizmo gizmo[33];
        // Offset 0x654
        U32 gizmos_used;
        // Offset 0x658
        uv_animated_model uv_swirl;
        // Offset 0x674
        uv_animated_model uv_wind;
    } hud;
    // void (*xAnimDefaultBeforeEnter)(xAnimPlay*, xAnimState*);
    // U32 (*check_anim_aim)(xAnimTransition*, xAnimSingle*, void*);
    // zGlobals globals;
    // RpAtomic* (*AtomicDefaultRenderCallBack)(RpAtomic*);
    // RpAtomic* (*custom_bubble_render)(RpAtomic*);
    // iColor_tag g_WHITE;
    // U32 gActiveHeap;
    // _anon0 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @20state_camera_restore;
    // _anon5 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @10state_type;
    // _anon6 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @19state_camera_survey;
    // _anon1 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @19state_camera_attach;
    // _anon9 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @18state_camera_seize;
    // _anon10 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @16state_camera_aim;
    // _anon3 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @20state_missle_explode;
    // _anon7 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @16state_missle_fly;
    // _anon2 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @19state_missle_appear;
    // _anon4 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @17state_player_wait;
    // _anon8 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @17state_player_fire;
    // _anon11 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @16state_player_aim;
    // _anon12 __vt__Q313cruise_bubble30 @unnamed @zEntCruiseBubble_cpp @17state_player_halt;
    // RpAtomic* (*gAtomicRenderCallBack)(RpAtomic*);
    // U32 gFXSurfaceFlags;
    // xVec3 m_UnitAxisY;
    // xGrid npcs_grid;
    // xGrid colls_oso_grid;
    // xGrid colls_grid;
    // U8 (*hazard_check)(NPCHazard&, void*);
    // xQCControl xqc_def_ctrl;
    // void (*SweptSphereHitsCameraEnt)(xScene*, xRay3*, xQCData*, xEnt*, void*);
    // void (*cb_droplet)(zFrag*, zFragAsset*);
    // U8 (*hazard_check)(NPCHazard&, void*);
    // U8 (*hazard_check)(NPCHazard&, void*);
    // S32 gGridIterActive;
} // namespace cruise_bubble

extern F32 zEntCruiseBubble_f_0_0; // 0.0
extern F32 zEntCruiseBubble_f_1_0; // 1.0
extern F32 zEntCruiseBubble_f_0_5; // 0.5
extern F32 zEntCruiseBubble_f_3_0; // 3.0
extern F32 zEntCruiseBubble_f_0_25; // 0.25
extern F32 zEntCruiseBubble_f_255_0; // 255.0
extern F32 zEntCruiseBubble_f_n1_0; // -1.0
extern F32 zEntCruiseBubble_f_100_0; // 100.0
extern F32 zEntCruiseBubble_f_n0_00001; // -0.00001
extern F32 zEntCruiseBubble_f_0_00001; // 0.00001
extern F32 zEntCruiseBubble_f_0_2; // 0.2
extern F32 zEntCruiseBubble_f_0_05; // 0.05
extern F32 zEntCruiseBubble_f_0_01; // 0.01
extern F32 zEntCruiseBubble_f_1000000000_0; // 1000000000.0
extern F32 zEntCruiseBubble_f_0_0667; // 0.0667
extern F32 zEntCruiseBubble_f_6_0; // 6.0
extern F32 zEntCruiseBubble_f_0_3; // 0.3
extern F32 zEntCruiseBubble_f_30_0; // 30.0
extern F32 zEntCruiseBubble_f_0_017; // 0.017 deg2rad
extern F32 zEntCruiseBubble_f_60_0; // 60.0
extern F32 zEntCruiseBubble_f_0_025; // 0.025
extern F32 zEntCruiseBubble_f_0_1333; // 0.1333
extern F32 zEntCruiseBubble_f_0_667; // 0.667
extern F32 zEntCruiseBubble_f_n0_049; // -0.049
extern F32 zEntCruiseBubble_f_1_728; // 1.728
extern F32 zEntCruiseBubble_f_0_922; // 0.922
extern F32 zEntCruiseBubble_f_12_0; // 12.0
extern F32 zEntCruiseBubble_f_10_0; // 10.0
extern F32 zEntCruiseBubble_f_0_005; // 0.005
extern F32 zEntCruiseBubble_f_2_0; // 2.0
extern F32 zEntCruiseBubble_f_5_0; // 5.0
extern F32 zEntCruiseBubble_f_4_0; // 4.0
extern F32 zEntCruiseBubble_f_0_1; // 0.1
extern F32 zEntCruiseBubble_f_0_6; // 0.6
extern F32 zEntCruiseBubble_f_1_5708; // 1.5708 90deg
extern F32 zEntCruiseBubble_f_1_5; // 1.5
extern F32 zEntCruiseBubble_f_n10_0; // -10.0
extern F32 zEntCruiseBubble_f_n90_0; // -90.0
extern F32 zEntCruiseBubble_f_90_0; // 90.0
extern F32 zEntCruiseBubble_f_720_0; // 720.0
extern F32 zEntCruiseBubble_f_360_0; // 360.0
extern F32 zEntCruiseBubble_f_135_0; // 135.0
extern F32 zEntCruiseBubble_f_0_001; // 0.001
extern F32 zEntCruiseBubble_f_95_0; // 95.0
extern F32 zEntCruiseBubble_f_180_0; // 180.0
extern F32 zEntCruiseBubble_f_8_0; // 8.0
extern F32 zEntCruiseBubble_f_0_99; // 0.1
extern F32 zEntCruiseBubble_f_0_8; // 0.8
extern F32 zEntCruiseBubble_f_0_75; // 0.75
extern F32 zEntCruiseBubble_f_10000_0; // 10000.0
extern F32 zEntCruiseBubble_f_22_5; // 22.5
extern F32 zEntCruiseBubble_f_n100000_0; // -100000.0
extern F32 zEntCruiseBubble_f_100000_0; // 100000.0
extern F32 zEntCruiseBubble_f_n1000000000_0; // -1000000000.0
extern F32 zEntCruiseBubble_f_0_0275; // 0.0275
extern F32 zEntCruiseBubble_f_0_047; // 0.047
extern F32 zEntCruiseBubble_f_0_78; // 0.78
extern F32 zEntCruiseBubble_f_0_86; // 0.86
extern F32 zEntCruiseBubble_f_0_15; // 0.15
extern F32 zEntCruiseBubble_f_0_0001; // 0.15
extern F32 zEntCruiseBubble_f_1_0e38; // 1.0 * 10^38
extern F32 zEntCruiseBubble_f_3_1415; // 3.1415 ~ PI
extern F32 zEntCruiseBubble_f_6_2832; // 6.2832 ~ 2PI
extern F32 zEntCruiseBubble_f_n3_1415; // -3.1415 ~ -PI
extern F32 zEntCruiseBubble_f_0_000001; // 0.000001

extern iColor_tag zEntCruiseBubble_color_80_00_00_FF; // 128, 0, 0, 255
extern iColor_tag zEntCruiseBubble_color_FF_14_14_FF; // 255, 20, 20, 255

extern xVec3 zEntCruiseBubble_xVec3_0_0_0; // {0.0, 0.0, 0.0}

extern xVec2 lbl_803D0830;

namespace cruise_bubble
{
    extern tweak_group* current_tweak;

    namespace
    {
        extern struct _class_36
        {
            S32 flags;
            state_type* state[MAX_THREAD];
            // Offset: 0x10
            state_type* states[MAX_STATE];
            // Offset: 0x40
            xVec2 last_sp;
            // Offset: 0x48
            xVec2 sp;
            // Offset: 0x50
            xVec3 hit_loc;
            // Offset: 0x5c
            xVec3 hit_norm;
            // Offset: 0x68
            xModelInstance* missle_model;
            // Offset: 0x6c
            xEnt* hits[32];
            // Offset: 0xec
            S32 hits_size;
            U32 player_health;
            xVec3 player_motion;
            // Offset: 0x100
            F32 fov_default;
            zShrapnelAsset* droplet_shrapnel;
            F32 dialog_freq;
            struct _class_45
            {
                F32 samples;
                F32 bubbles;
                xMat4x3 mat;
                xQuat dir;
            } trail;
            struct _class_6
            {
                struct _class_8
                {
                    xAnimState* aim;
                    xAnimState* fire;
                    xAnimState* idle;
                } player;
                struct _class_16
                {
                    // Offset: 0x170
                    xAnimState* fire;
                    xAnimState* fly;
                } missle;
            } astate;
            struct _class_25
            {
                struct _class_28
                {
                    xAnimTransition* aim;
                    xAnimTransition* fire;
                    xAnimTransition* idle;
                    xAnimTransition* end;
                } player;
                struct _class_33
                {
                    xAnimTransition* fly;
                } missle;
            } atran;
        } shared;

        xMat4x3 start_cam_mat;
        tweak_group normal_tweak;
        tweak_group cheat_tweak;
        extern xBase base;

        void init_sound()
        {
            sound_config* s;
            sound_config* end = &sounds[4];
            for (s = &sounds[0]; s != end; ++s)
            {
                s->id = (s->name == 0) ? 0 : xStrHash(s->name);
