/*
    Compile unit: C:\SB\Core\p2\iSystem.cpp
    Producer: MW MIPS C Compiler
    Language: C++
*/
char buffer[16]; // size: 0x10, address: 0x0
char buffer[16]; // size: 0x10, address: 0x0
void * hackResourceArenaPointer; // size: 0x4, address: 0x0
signed int DVD; // size: 0x4, address: 0x50F878
static signed int g_dumpEachAllocOp; // size: 0x4, address: 0x0
class RwVideoMode sVideoMode; // size: 0x18, address: 0x53CCD0
signed int gFB_Flags; // size: 0x4, address: 0x50E804
class DBWATCHData * g_watchthisblock; // size: 0x4, address: 0x0
unsigned int gVsyncCount; // size: 0x4, address: 0x50F87C
unsigned int gTransitionSceneID; // size: 0x4, address: 0x50F708
signed int vsyncCounterHandler(signed int); // size: 0x0, address: 0x1BA2E0
class RwTexture * TextureRead(char *, char *); // size: 0x0, address: 0x1BA0E0
class RpPDSSkyObjTemplate rwPDS_G3_SkinfxUV2_AtmPipe; // size: 0x14, address: 0x41AE58
class RpPDSSkyObjTemplate rwPDS_G3_SkinfxUV1_AtmPipe; // size: 0x14, address: 0x41AE40
class RpPDSSkyMatTemplate rwPDS_G3_SkinfxUV2_MatPipe; // size: 0x84, address: 0x41ADB8
class RpPDSSkyMatTemplate rwPDS_G3_SkinfxUV1_MatPipe; // size: 0x84, address: 0x41AD30
class RpPDSSkyObjTemplate rwPDS_G3_Skin_AtmPipe; // size: 0x14, address: 0x41ACA8
class RpPDSSkyMatTemplate rwPDS_G3_Skin_MatPipe; // size: 0x84, address: 0x41AC20
class RpPDSSkyObjTemplate rwPDS_G3_MatfxUV2_SctPipe; // size: 0x14, address: 0x41ABE8
class RpPDSSkyObjTemplate rwPDS_G3_MatfxUV1_SctPipe; // size: 0x14, address: 0x41ABD0
class RpPDSSkyObjTemplate rwPDS_G3_MatfxUV2_AtmPipe; // size: 0x14, address: 0x41ABB8
class RpPDSSkyObjTemplate rwPDS_G3_MatfxUV1_AtmPipe; // size: 0x14, address: 0x41ABA0
class RpPDSSkyMatTemplate rwPDS_G3_MatfxUV2_MatPipe; // size: 0x84, address: 0x41AB18
class RpPDSSkyMatTemplate rwPDS_G3_MatfxUV1_MatPipe; // size: 0x84, address: 0x41AA90
class RpPDSSkyObjTemplate rwPDS_G3_Im3D_SegObjPipe; // size: 0x14, address: 0x41A800
class RpPDSSkyObjTemplate rwPDS_G3_Im3D_TriObjPipe; // size: 0x14, address: 0x41A7E8
class RpPDSSkyMatTemplate rwPDS_G3_Im3D_SegPipe; // size: 0x84, address: 0x41A760
class RpPDSSkyMatTemplate rwPDS_G3_Im3D_TriPipe; // size: 0x84, address: 0x41A6D8
class RpPDSSkyObjTemplate rwPDS_G3_Generic_SctPipe; // size: 0x14, address: 0x41A6C0
class RpPDSSkyObjTemplate rwPDS_G3_Generic_AtmPipe; // size: 0x14, address: 0x41A6A8
class RpPDSSkyMatTemplate rwPDS_G3_Generic_MatPipe; // size: 0x84, address: 0x41A620
class RpPDSSkyObjTemplate rwPDS_G3x_OPLClone_AtmPipe; // size: 0x14, address: 0x41B630
class RpPDSSkyMatTemplate rwPDS_G3x_OPLClone_MatPipe; // size: 0x84, address: 0x41B5A8
class RpPDSSkyMatTemplate rwPDS_G3xd_ADLGem_MatPipe; // size: 0x84, address: 0x41B278
class RpPDSSkyMatTemplate rwPDS_G3xd_A4DSkinGem_MatPipe; // size: 0x84, address: 0x41B520
class RpPDSSkyMatTemplate rwPDS_G3xd_ADLSkinGem_MatPipe; // size: 0x84, address: 0x41B498
class RpPDSSkyMatTemplate rwPDS_G3xd_A4DGem_MatPipe; // size: 0x84, address: 0x41B300
class RpPDSSkyMatTemplate rwPDS_G3xd_A4DSkin_MatPipe; // size: 0x84, address: 0x41B410
class RpPDSSkyMatTemplate rwPDS_G3xd_ADLSkin_MatPipe; // size: 0x84, address: 0x41B388
class RpPDSSkyMatTemplate rwPDS_G3xd_A4D_MatPipe; // size: 0x84, address: 0x41B1F0
class RpPDSSkyMatTemplate rwPDS_G3xd_ADL_MatPipe; // size: 0x84, address: 0x41B168
class RpPDSSkyMatTemplate rwPDS_G3x_A4DSkin_MatPipe; // size: 0x84, address: 0x41B0E0
class RpPDSSkyMatTemplate rwPDS_G3x_ADLSkin_MatPipe; // size: 0x84, address: 0x41B058
class RpPDSSkyObjTemplate rwPDS_G3x_Skin_AtmPipe; // size: 0x14, address: 0x41B040
class RpPDSSkyMatTemplate rwPDS_G3x_A4D_MatPipe; // size: 0x84, address: 0x41AF10
class RpPDSSkyMatTemplate rwPDS_G3x_ADL_MatPipe; // size: 0x84, address: 0x41AE88
class RpPDSSkyObjTemplate rwPDS_G3x_Generic_AtmPipe; // size: 0x14, address: 0x41AE70
class RxPipelineNodeParam {
    // total size: 0x8
public:
    void * dataParam; // offset 0x0, size 0x4
    class RxHeap * heap; // offset 0x4, size 0x4
};
enum RwPrimitiveType {
    rwPRIMTYPENAPRIMTYPE = 0,
    rwPRIMTYPELINELIST = 1,
    rwPRIMTYPEPOLYLINE = 2,
    rwPRIMTYPETRILIST = 3,
    rwPRIMTYPETRISTRIP = 4,
    rwPRIMTYPETRIFAN = 5,
    rwPRIMTYPEPOINTLIST = 6,
    rwPRIMITIVETYPEFORCEENUMSIZEINT = 2147483647,
};
class RwSurfaceProperties {
    // total size: 0xC
public:
    float ambient; // offset 0x0, size 0x4
    float specular; // offset 0x4, size 0x4
    float diffuse; // offset 0x8, size 0x4
};
class RxHeap {
    // total size: 0x1C
public:
    unsigned int superBlockSize; // offset 0x0, size 0x4
    class rxHeapSuperBlockDescriptor * head; // offset 0x4, size 0x4
    class rxHeapBlockHeader * headBlock; // offset 0x8, size 0x4
    class rxHeapFreeBlock * freeBlocks; // offset 0xC, size 0x4
    unsigned int entriesAlloced; // offset 0x10, size 0x4
    unsigned int entriesUsed; // offset 0x14, size 0x4
    signed int dirty; // offset 0x18, size 0x4
};
class RxPS2AllPipeData {
    // total size: 0x48
public:
    class rxNodePS2AllPvtData * objPvtData; // offset 0x0, size 0x4
    class rxNodePS2AllMatPvtData * matPvtData; // offset 0x4, size 0x4
    void * sourceObject; // offset 0x8, size 0x4
    class RpMeshHeader * meshHeader; // offset 0xC, size 0x4
    class RwMeshCache * meshCache; // offset 0x10, size 0x4
    enum RxInstanceFlags objInstance; // offset 0x14, size 0x4
    unsigned int objIdentifier; // offset 0x18, size 0x4
    float spExtra; // offset 0x1C, size 0x4
    signed int numMorphTargets; // offset 0x20, size 0x4
    unsigned int fastMorphing; // offset 0x24, size 0x4
    unsigned char transType; // offset 0x28, size 0x1
    unsigned char primType; // offset 0x29, size 0x1
    unsigned char matModulate; // offset 0x2A, size 0x1
    unsigned char vu1CodeIndex; // offset 0x2B, size 0x1
    class RpMesh * mesh; // offset 0x2C, size 0x4
    class RwResEntry * * cacheEntryRef; // offset 0x30, size 0x4
    enum RxInstanceFlags meshInstance; // offset 0x34, size 0x4
    unsigned int meshIdentifier; // offset 0x38, size 0x4
    class RwSurfaceProperties * surfProps; // offset 0x3C, size 0x4
    class RwTexture * texture; // offset 0x40, size 0x4
    class RwRGBA matCol; // offset 0x44, size 0x4
};
class RwTexture {
    // total size: 0x58
public:
    class RwRaster * raster; // offset 0x0, size 0x4
    class RwTexDictionary * dict; // offset 0x4, size 0x4
    class RwLLLink lInDictionary; // offset 0x8, size 0x8
    char name[32]; // offset 0x10, size 0x20
    char mask[32]; // offset 0x30, size 0x20
    unsigned int filterAddressing; // offset 0x50, size 0x4
    signed int refCount; // offset 0x54, size 0x4
};
class RwRGBA {
    // total size: 0x4
public:
    unsigned char red; // offset 0x0, size 0x1
    unsigned char green; // offset 0x1, size 0x1
    unsigned char blue; // offset 0x2, size 0x1
    unsigned char alpha; // offset 0x3, size 0x1
};
class rwPS2AllFieldRec {
    // total size: 0x18
public:
    signed int numVerts; // offset 0x0, size 0x4
    signed int morphNumVerts; // offset 0x4, size 0x4
    signed int dataoffset; // offset 0x8, size 0x4
    signed int morphDataoffset; // offset 0xC, size 0x4
    signed short skip; // offset 0x10, size 0x2
    signed short morphSkip; // offset 0x12, size 0x2
    signed short reverse; // offset 0x14, size 0x2
    unsigned char vuoffset; // offset 0x16, size 0x1
    unsigned char pad[1]; // offset 0x17, size 0x1
};
class RxPipelineNode {
    // total size: 0x28
public:
    class RxNodeDefinition * nodeDef; // offset 0x0, size 0x4
    unsigned int numOutputs; // offset 0x4, size 0x4
    unsigned int * outputs; // offset 0x8, size 0x4
    class RxPipelineCluster * * slotClusterRefs; // offset 0xC, size 0x4
    unsigned int * slotsContinue; // offset 0x10, size 0x4
    void * privateData; // offset 0x14, size 0x4
    unsigned int * inputToClusterSlot; // offset 0x18, size 0x4
    class RxPipelineNodeTopSortData * topSortData; // offset 0x1C, size 0x4
    void * initializationData; // offset 0x20, size 0x4
    unsigned int initializationDataSize; // offset 0x24, size 0x4
};
class RwV3d {
    // total size: 0xC
public:
    float x; // offset 0x0, size 0x4
    float y; // offset 0x4, size 0x4
    float z; // offset 0x8, size 0x4
};
class RxPipelineNodeTopSortData {
    // total size: 0xC
public:
    unsigned int numIns; // offset 0x0, size 0x4
    unsigned int numInsVisited; // offset 0x4, size 0x4
    class rxReq * req; // offset 0x8, size 0x4
};
class rxNodePS2AllMatPvtData {
    // total size: 0x32C
public:
    signed int (* meshInstanceTestCB)(class RxPS2AllPipeData *); // offset 0x0, size 0x4
    class RwResEntry * (* resEntryAllocCB)(class RxPS2AllPipeData *, class RwResEntry * *, unsigned int, void (*)(class RwResEntry *)); // offset 0x4, size 0x4
    signed int (* instanceCB)(class RxPS2AllPipeData *, void * *, unsigned int); // offset 0x8, size 0x4
    signed int (* bridgeCB)(class RxPS2AllPipeData *); // offset 0xC, size 0x4
    signed int (* postMeshCB)(class RxPS2AllPipeData *); // offset 0x10, size 0x4
    signed int vifOffset; // offset 0x14, size 0x4
    void * * vu1CodeArray; // offset 0x18, size 0x4
    unsigned int codeArrayLength; // offset 0x1C, size 0x4
    class rwPS2AllClusterInstanceInfo clinfo[12]; // offset 0x20, size 0x60
    unsigned int cliIndex[12]; // offset 0x80, size 0x30
    enum RpMeshHeaderFlags pipeType; // offset 0xB0, size 0x4
    unsigned char totallyOpaque; // offset 0xB4, size 0x1
    unsigned char numStripes; // offset 0xB5, size 0x1
    unsigned char sizeOnVU; // offset 0xB6, size 0x1
    unsigned char pad0; // offset 0xB7, size 0x1
    class rwPS2AllResEntryFormat strip; // offset 0xB8, size 0x138
    class rwPS2AllResEntryFormat list; // offset 0x1F0, size 0x138
    unsigned int magicValue; // offset 0x328, size 0x4
};
class rxHeapBlockHeader {
    // total size: 0x20
public:
    class rxHeapBlockHeader * prev; // offset 0x0, size 0x4
    class rxHeapBlockHeader * next; // offset 0x4, size 0x4
    unsigned int size; // offset 0x8, size 0x4
    class rxHeapFreeBlock * freeEntry; // offset 0xC, size 0x4
    unsigned int pad[4]; // offset 0x10, size 0x10
};
class DBWATCHData {
    // total size: 0x200
public:
    char putWatchOnMe[512]; // offset 0x0, size 0x200
};
class sceCdCLOCK {
    // total size: 0x8
public:
    unsigned char stat; // offset 0x0, size 0x1
    unsigned char second; // offset 0x1, size 0x1
    unsigned char minute; // offset 0x2, size 0x1
    unsigned char hour; // offset 0x3, size 0x1
    unsigned char pad; // offset 0x4, size 0x1
    unsigned char day; // offset 0x5, size 0x1
    unsigned char month; // offset 0x6, size 0x1
    unsigned char year; // offset 0x7, size 0x1
};
class RpPDSSkyMatTemplate {
    // total size: 0x84
public:
    unsigned int pluginId; // offset 0x0, size 0x4
    unsigned int pluginData; // offset 0x4, size 0x4
    class RpPDSSkyMatCluster clusters[10]; // offset 0x8, size 0x50
    class RpPDSSkyMatPrimitive primitive; // offset 0x58, size 0x14
    class RpPDSSkyVU1CodeTemplate * vu1code; // offset 0x6C, size 0x4
    signed int (* meshInstanceTestCallBack)(class RxPS2AllPipeData *); // offset 0x70, size 0x4
    class RwResEntry * (* resEntryAllocCallBack)(class RxPS2AllPipeData *, class RwResEntry * *, unsigned int, void (*)(class RwResEntry *)); // offset 0x74, size 0x4
    signed int (* instanceCallBack)(class RxPS2AllPipeData *, void * *, unsigned int); // offset 0x78, size 0x4
    signed int (* bridgeCallBack)(class RxPS2AllPipeData *); // offset 0x7C, size 0x4
    signed int (* postMeshCallBack)(class RxPS2AllPipeData *); // offset 0x80, size 0x4
};
class RxPipelineRequiresCluster {
    // total size: 0xC
public:
    class RxClusterDefinition * clusterDef; // offset 0x0, size 0x4
    enum RxClusterValidityReq rqdOrOpt; // offset 0x4, size 0x4
    unsigned int slotIndex; // offset 0x8, size 0x4
};
class RxPipeline {
    // total size: 0x34
public:
    signed int locked; // offset 0x0, size 0x4
    unsigned int numNodes; // offset 0x4, size 0x4
    class RxPipelineNode * nodes; // offset 0x8, size 0x4
    unsigned int packetNumClusterSlots; // offset 0xC, size 0x4
    enum rxEmbeddedPacketState embeddedPacketState; // offset 0x10, size 0x4
    class RxPacket * embeddedPacket; // offset 0x14, size 0x4
    unsigned int numInputRequirements; // offset 0x18, size 0x4
    class RxPipelineRequiresCluster * inputRequirements; // offset 0x1C, size 0x4
    void * superBlock; // offset 0x20, size 0x4
    unsigned int superBlockSize; // offset 0x24, size 0x4
    unsigned int entryPoint; // offset 0x28, size 0x4
    unsigned int pluginId; // offset 0x2C, size 0x4
    unsigned int pluginData; // offset 0x30, size 0x4
};
class RpPDSSkyVU1CodeTemplate {
    // total size: 0x8
public:
    void * * array; // offset 0x0, size 0x4
    unsigned int slots; // offset 0x4, size 0x4
};
enum RxInstanceFlags {
    rxINSTANCENAINSTANCEFLAG = 0,
    rxINSTANCEDONTINSTANCE = 1,
    rxINSTANCEINPLACEINSTANCE = 2,
    rxINSTANCECONGRUENTINSTANCE = 4,
    rxINSTANCEFULLINSTANCE = 8,
    rxINSTANCETYPEMASK = 14,
    rxINSTANCEXYZ = 16,
    rxINSTANCENORMAL = 32,
    rxINSTANCERGBA = 64,
    rxINSTANCEUV = 128,
    rxINSTANCEUV1 = 128,
    rxINSTANCEUV2 = 256,
    rxINSTANCEUV3 = 512,
    rxINSTANCEUV4 = 1024,
    rxINSTANCEUV5 = 2048,
    rxINSTANCEUV6 = 4096,
    rxINSTANCEUV7 = 8192,
    rxINSTANCEUV8 = 16384,
    rxINSTANCEUSER1 = 32768,
    rxINSTANCEUSER2 = 65536,
    rxINSTANCEUSER3 = 131072,
    rxINSTANCEUSER4 = 262144,
    rxINSTANCEALL = 524272,
    rxINSTANCEMASK = 524287,
    rxINSTANCEFORCEENUMSIZEINT = 2147483647,
};
class RwMatrixTag {
    // total size: 0x40
public:
    class RwV3d right; // offset 0x0, size 0xC
    unsigned int flags; // offset 0xC, size 0x4
    class RwV3d up; // offset 0x10, size 0xC
    unsigned int pad1; // offset 0x1C, size 0x4
    class RwV3d at; // offset 0x20, size 0xC
    unsigned int pad2; // offset 0x2C, size 0x4
    class RwV3d pos; // offset 0x30, size 0xC
    unsigned int pad3; // offset 0x3C, size 0x4
};
class RpMaterial {
    // total size: 0x1C
public:
    class RwTexture * texture; // offset 0x0, size 0x4
    class RwRGBA color; // offset 0x4, size 0x4
    class RxPipeline * pipeline; // offset 0x8, size 0x4
    class RwSurfaceProperties surfaceProps; // offset 0xC, size 0xC
    signed short refCount; // offset 0x18, size 0x2
    signed short pad; // offset 0x1A, size 0x2
};
class rxHeapSuperBlockDescriptor {
    // total size: 0xC
public:
    void * start; // offset 0x0, size 0x4
    unsigned int size; // offset 0x4, size 0x4
    class rxHeapSuperBlockDescriptor * next; // offset 0x8, size 0x4
};
class rxReq {
    // total size: 0x0
};
class RwRaster {
    // total size: 0x34
public:
    class RwRaster * parent; // offset 0x0, size 0x4
    unsigned char * cpPixels; // offset 0x4, size 0x4
    unsigned char * palette; // offset 0x8, size 0x4
    signed int width; // offset 0xC, size 0x4
    signed int height; // offset 0x10, size 0x4
    signed int depth; // offset 0x14, size 0x4
    signed int stride; // offset 0x18, size 0x4
    signed short nOffsetX; // offset 0x1C, size 0x2
    signed short nOffsetY; // offset 0x1E, size 0x2
    unsigned char cType; // offset 0x20, size 0x1
    unsigned char cFlags; // offset 0x21, size 0x1
    unsigned char privateFlags; // offset 0x22, size 0x1
    unsigned char cFormat; // offset 0x23, size 0x1
    unsigned char * originalPixels; // offset 0x24, size 0x4
    signed int originalWidth; // offset 0x28, size 0x4
    signed int originalHeight; // offset 0x2C, size 0x4
    signed int originalStride; // offset 0x30, size 0x4
};
enum RxClusterValidityReq {
    rxCLREQ_DONTWANT = 0,
    rxCLREQ_REQUIRED = 1,
    rxCLREQ_OPTIONAL = 2,
    rxCLUSTERVALIDITYREQFORCEENUMSIZEINT = 2147483647,
};
enum RwVideoModeFlag {
    rwVIDEOMODEEXCLUSIVE = 1,
    rwVIDEOMODEINTERLACE = 2,
    rwVIDEOMODEFFINTERLACE = 4,
    rwVIDEOMODE_PS2_FSAASHRINKBLIT = 256,
    rwVIDEOMODE_PS2_FSAAREADCIRCUIT = 512,
    rwVIDEOMODE_XBOX_WIDESCREEN = 256,
    rwVIDEOMODE_XBOX_PROGRESSIVE = 512,
    rwVIDEOMODE_XBOX_FIELD = 1024,
    rwVIDEOMODE_XBOX_10X11PIXELASPECT = 2048,
    rwVIDEOMODEFLAGFORCEENUMSIZEINT = 2147483647,
};
class rwPS2AllResEntryFormat {
    // total size: 0x138
public:
    unsigned char batchRound; // offset 0x0, size 0x1
    unsigned char stripReverse; // offset 0x1, size 0x1
    unsigned char pad[2]; // offset 0x2, size 0x2
    unsigned int maxInputSize; // offset 0x4, size 0x4
    signed int batchSize; // offset 0x8, size 0x4
    signed int batchesPerTag; // offset 0xC, size 0x4
    signed int morphBatchSize; // offset 0x10, size 0x4
    signed int morphBatchesPerTag; // offset 0x14, size 0x4
    class rwPS2AllFieldRec fieldRec[12]; // offset 0x18, size 0x120
};
enum RxNodeDefEditable {
    rxNODEDEFCONST = 0,
    rxNODEDEFEDITABLE = 1,
    rxNODEDEFEDITABLEFORCEENUMSIZEINT = 2147483647,
};
enum RxClusterValid {
    rxCLVALID_NOCHANGE = 0,
    rxCLVALID_VALID = 1,
    rxCLVALID_INVALID = 2,
    rxCLUSTERVALIDFORCEENUMSIZEINT = 2147483647,
};
class rxHeapFreeBlock {
    // total size: 0x8
public:
    unsigned int size; // offset 0x0, size 0x4
    class rxHeapBlockHeader * ptr; // offset 0x4, size 0x4
};
class RpPDSSkyObjTemplate {
    // total size: 0x14
public:
    unsigned int pluginId; // offset 0x0, size 0x4
    unsigned int pluginData; // offset 0x4, size 0x4
    signed int (* objectSetupCallBack)(class RxPS2AllPipeData *, class RwMatrixTag * *); // offset 0x8, size 0x4
    signed int (* objectFinalizeCallBack)(class RxPS2AllPipeData *); // offset 0xC, size 0x4
    class RxPipeline * matGroup; // offset 0x10, size 0x4
};
enum rxEmbeddedPacketState {
    rxPKST_PACKETLESS = 0,
    rxPKST_UNUSED = 1,
    rxPKST_INUSE = 2,
    rxPKST_PENDING = 3,
    rxEMBEDDEDPACKETSTATEFORCEENUMSIZEINT = 2147483647,
};
enum RxClusterForcePresent {
    rxCLALLOWABSENT = 0,
    rxCLFORCEPRESENT = 1,
    rxCLUSTERFORCEPRESENTFORCEENUMSIZEINT = 2147483647,
};
enum RpPDSPipeType {
    rpNAPDSPIPETYPE = 0,
    rpPDSMATPIPE = 1,
    rpPDSOBJPIPE = 2,
    rpPDSPIPETYPEFORCEENUMSIZEINT = 2147483647,
};
class RxClusterDefinition {
    // total size: 0x10
public:
    char * name; // offset 0x0, size 0x4
    unsigned int defaultStride; // offset 0x4, size 0x4
    unsigned int defaultAttributes; // offset 0x8, size 0x4
    char * attributeSet; // offset 0xC, size 0x4
};
class RwTexDictionary {
    // total size: 0x18
public:
    class RwObject object; // offset 0x0, size 0x8
    class RwLinkList texturesInDict; // offset 0x8, size 0x8
    class RwLLLink lInInstance; // offset 0x10, size 0x8
};
class RwVideoMode {
    // total size: 0x18
public:
    signed int width; // offset 0x0, size 0x4
    signed int height; // offset 0x4, size 0x4
    signed int depth; // offset 0x8, size 0x4
    enum RwVideoModeFlag flags; // offset 0xC, size 0x4
    signed int refRate; // offset 0x10, size 0x4
    signed int format; // offset 0x14, size 0x4
};
class RxOutputSpec {
    // total size: 0xC
public:
    char * name; // offset 0x0, size 0x4
    enum RxClusterValid * outputClusters; // offset 0x4, size 0x4
    enum RxClusterValid allOtherClusters; // offset 0x8, size 0x4
};
class RpPDSPipeDefinition {
    // total size: 0x4
public:
    union { // inferred
        void * ptr; // offset 0x0, size 0x4
        class RpPDSSkyMatTemplate * mat; // offset 0x0, size 0x4
        class RpPDSSkyObjTemplate * obj; // offset 0x0, size 0x4
    };
};
class RxClusterRef {
    // total size: 0xC
public:
    class RxClusterDefinition * clusterDef; // offset 0x0, size 0x4
    enum RxClusterForcePresent forcePresent; // offset 0x4, size 0x4
    unsigned int reserved; // offset 0x8, size 0x4
};
class RwMeshCache {
    // total size: 0x8
public:
    unsigned int lengthOfMeshesArray; // offset 0x0, size 0x4
    class RwResEntry * meshes[1]; // offset 0x4, size 0x4
};
class RwObject {
    // total size: 0x8
public:
    unsigned char type; // offset 0x0, size 0x1
    unsigned char subType; // offset 0x1, size 0x1
    unsigned char flags; // offset 0x2, size 0x1
    unsigned char privateFlags; // offset 0x3, size 0x1
    void * parent; // offset 0x4, size 0x4
};
class RwLLLink {
    // total size: 0x8
public:
    class RwLLLink * next; // offset 0x0, size 0x4
    class RwLLLink * prev; // offset 0x4, size 0x4
};
class RpMesh {
    // total size: 0xC
public:
    unsigned short * indices; // offset 0x0, size 0x4
    unsigned int numIndices; // offset 0x4, size 0x4
    class RpMaterial * material; // offset 0x8, size 0x4
};
class RxIoSpec {
    // total size: 0x14
public:
    unsigned int numClustersOfInterest; // offset 0x0, size 0x4
    class RxClusterRef * clustersOfInterest; // offset 0x4, size 0x4
    enum RxClusterValidityReq * inputRequirements; // offset 0x8, size 0x4
    unsigned int numOutputs; // offset 0xC, size 0x4
    class RxOutputSpec * outputs; // offset 0x10, size 0x4
};
class RwResEntry {
    // total size: 0x18
public:
    class RwLLLink link; // offset 0x0, size 0x8
    signed int size; // offset 0x8, size 0x4
    void * owner; // offset 0xC, size 0x4
    class RwResEntry * * ownerRef; // offset 0x10, size 0x4
    void (* destroyNotify)(class RwResEntry *); // offset 0x14, size 0x4
};
class RxNodeMethods {
    // total size: 0x1C
public:
    signed int (* nodeBody)(class RxPipelineNode *, class RxPipelineNodeParam *); // offset 0x0, size 0x4
    signed int (* nodeInit)(class RxNodeDefinition *); // offset 0x4, size 0x4
    void (* nodeTerm)(class RxNodeDefinition *); // offset 0x8, size 0x4
    signed int (* pipelineNodeInit)(class RxPipelineNode *); // offset 0xC, size 0x4
    void (* pipelineNodeTerm)(class RxPipelineNode *); // offset 0x10, size 0x4
    signed int (* pipelineNodeConfig)(class RxPipelineNode *, class RxPipeline *); // offset 0x14, size 0x4
    unsigned int (* configMsgHandler)(class RxPipelineNode *, unsigned int, unsigned int, void *); // offset 0x18, size 0x4
};
class RxPipelineCluster {
    // total size: 0x8
public:
    class RxClusterDefinition * clusterRef; // offset 0x0, size 0x4
    unsigned int creationAttributes; // offset 0x4, size 0x4
};
class RpPDSRegister {
    // total size: 0x14
public:
    class RpPDSPipeDefinition def; // offset 0x0, size 0x4
    enum RpPDSPipeID attachId; // offset 0x4, size 0x4
    enum RpPDSPipeID id; // offset 0x8, size 0x4
    enum RpPDSPipeType type; // offset 0xC, size 0x4
    class RxPipeline * pipe; // offset 0x10, size 0x4
};
enum RpPDSPipeID {
    rpNAPDSPIPEID = 0,
    rwPDS_G3_Generic_MatPipeID = 1,
    rwPDS_G3_Generic_AtmPipeID = 2,
    rwPDS_G3_Generic_SctPipeID = 3,
    rwPDS_G3_Im3D_TriPipeID = 4,
    rwPDS_G3_Im3D_SegPipeID = 5,
    rwPDS_G3_Im3D_TriObjPipeID = 6,
    rwPDS_G3_Im3D_SegObjPipeID = 7,
    rwPDS_G3_Generic_GrpMatPipeID = 4097,
    rwPDS_G3_Generic_GrpAtmPipeID = 4098,
    rwPDS_G3_Generic_GrpSctPipeID = 4099,
    rwPDS_G3_Skin_MatPipeID = 65537,
    rwPDS_G3_Skin_AtmPipeID = 65538,
    rwPDS_G3_Emb_MatPipeID = 65539,
    rwPDS_G3_Gem_MatPipeID = 65540,
    rwPDS_G3_Bem_MatPipeID = 65541,
    rwPDS_G3_Dup_MatPipeID = 65542,
    rwPDS_G3_Toon_MatPipeID = 65543,
    rwPDS_G3_SkinEmb_MatPipeID = 65544,
    rwPDS_G3_SkinGem_MatPipeID = 65545,
    rwPDS_G3_SkinBem_MatPipeID = 65546,
    rwPDS_G3_SkinDup_MatPipeID = 65547,
    rwPDS_G3_SkinToon_MatPipeID = 65548,
    rwPDS_G2_BPatch_AtmPipeID = 65549,
    rwPDS_G2_BPatch_MatPipeID = 65550,
    rwPDS_G2_SkinBPatch_AtmPipeID = 65551,
    rwPDS_G2_SkinBPatch_MatPipeID = 65552,
    rwPDS_G2_EmbBPatch_MatPipeID = 65553,
    rwPDS_G2_GemBPatch_MatPipeID = 65554,
    rwPDS_G2_BemBPatch_MatPipeID = 65555,
    rwPDS_G2_DupBPatch_MatPipeID = 65556,
    rwPDS_G2_SkinEmbBPatch_MatPipeID = 65557,
    rwPDS_G2_SkinGemBPatch_MatPipeID = 65558,
    rwPDS_G2_SkinBemBPatch_MatPipeID = 65559,
    rwPDS_G2_SkinDupBPatch_MatPipeID = 65560,
    rwPDS_G3_2DStroke_MatPipeID = 65561,
    rwPDS_G3_2DStroke_ObjPipeID = 65562,
    rwPDS_G3_2DFont_MatPipeID = 65563,
    rwPDS_G3_2DFont_ObjPipeID = 65564,
    rwPDS_G3_2DFill_MatPipeID = 65565,
    rwPDS_G3_2DFill_ObjPipeID = 65566,
    rwPDS_G3_SkSpt_AtmPipeID = 65567,
    rwPDS_G3_SkSpt_MatPipeID = 65568,
    rwPDS_G3_SkSptEmb_MatPipeID = 65569,
    rwPDS_G3_SkSptGem_MatPipeID = 65570,
    rwPDS_G3_SkSptBem_MatPipeID = 65571,
    rwPDS_G3_SkSptDup_MatPipeID = 65572,
    rwPDS_G3_SkSptToon_MatPipeID = 65573,
    rwPDS_G3_Uva_MatPipeID = 65574,
    rwPDS_G3_DupUva_MatPipeID = 65575,
    rwPDS_G3_SkinUva_MatPipeID = 65576,
    rwPDS_G3_SkinDupUva_MatPipeID = 65577,
    rwPDS_G3_SkSptUva_MatPipeID = 65578,
    rwPDS_G3_SkSptDupUva_MatPipeID = 65579,
    rwPDS_G3_Skin_GrpMatPipeID = 69633,
    rwPDS_G3_Skin_GrpAtmPipeID = 69634,
    rwPDS_G2_DarkMaps_GrpMatPipeID = 69635,
    rwPDS_G2_DarkMaps_GrpAtmPipeID = 69636,
    rwPDS_G2_DarkMaps_GrpSctPipeID = 69637,
    rwPDS_G3_Toon_GrpMatPipeID = 69638,
    rwPDS_G3_Toon_GrpAtmPipeID = 69639,
    rwPDS_G3_Toon_GrpSctPipeID = 69640,
    rwPDS_G3_SkinToon_GrpMatPipeID = 69641,
    rwPDS_G3_SkinToon_GrpAtmPipeID = 69642,
    rwPDS_G3_MatfxUV1_GrpMatPipeID = 69643,
    rwPDS_G3_MatfxUV2_GrpMatPipeID = 69644,
    rwPDS_G3_MatfxUV1_GrpAtmPipeID = 69645,
    rwPDS_G3_MatfxUV2_GrpAtmPipeID = 69646,
    rwPDS_G3_MatfxUV1_GrpSctPipeID = 69647,
    rwPDS_G3_MatfxUV2_GrpSctPipeID = 69648,
    rwPDS_G3_SkinfxUV1_GrpMatPipeID = 69649,
    rwPDS_G3_SkinfxUV2_GrpMatPipeID = 69650,
    rwPDS_G3_SkinfxUV1_GrpAtmPipeID = 69651,
    rwPDS_G3_SkinfxUV2_GrpAtmPipeID = 69652,
    rwPDS_G2_BPatch_GrpAtmPipeID = 69653,
    rwPDS_G2_BPatch_GrpMatPipeID = 69654,
    rwPDS_G2_SkinBPatch_GrpAtmPipeID = 69655,
    rwPDS_G2_SkinBPatch_GrpMatPipeID = 69656,
    rwPDS_G2_MatfxUV1BPatch_GrpMatPipeID = 69657,
    rwPDS_G2_MatfxUV2BPatch_GrpMatPipeID = 69658,
    rwPDS_G2_MatfxUV1BPatch_GrpAtmPipeID = 69659,
    rwPDS_G2_MatfxUV2BPatch_GrpAtmPipeID = 69660,
    rwPDS_G2_SkinfxUV1BPatch_GrpMatPipeID = 69661,
    rwPDS_G2_SkinfxUV2BPatch_GrpMatPipeID = 69662,
    rwPDS_G2_SkinfxUV1BPatch_GrpAtmPipeID = 69663,
    rwPDS_G2_SkinfxUV2BPatch_GrpAtmPipeID = 69664,
    rwPDS_VCL_Uva_MatPipeID = 73728,
    rwPDS_VCL_DupUva_MatPipeID = 73729,
    rwPDS_VCL_SkinUva_MatPipeID = 73730,
    rwPDS_VCL_SkinDupUva_MatPipeID = 73731,
    rwPDS_G3x_Generic_AtmPipeID = 327681,
    rwPDS_G3x_APL_MatPipeID = 327682,
    rwPDS_G3x_ADL_MatPipeID = 327683,
    rwPDS_G3x_A4D_MatPipeID = 327684,
    rwPDS_G3x_APLDup_MatPipeID = 327685,
    rwPDS_G3x_ADLDup_MatPipeID = 327686,
    rwPDS_G3x_A4DDup_MatPipeID = 327687,
    rwPDS_G3x_APLGem_MatPipeID = 327688,
    rwPDS_G3x_ADLGem_MatPipeID = 327689,
    rwPDS_G3x_A4DGem_MatPipeID = 327690,
    rwPDS_G3x_Skin_AtmPipeID = 327691,
    rwPDS_G3x_APLSkin_MatPipeID = 327692,
    rwPDS_G3x_ADLSkin_MatPipeID = 327693,
    rwPDS_G3x_A4DSkin_MatPipeID = 327694,
    rwPDS_G3x_APLSkinDup_MatPipeID = 327695,
    rwPDS_G3x_ADLSkinDup_MatPipeID = 327696,
    rwPDS_G3x_A4DSkinDup_MatPipeID = 327697,
    rwPDS_G3x_APLSkinGem_MatPipeID = 327698,
    rwPDS_G3x_ADLSkinGem_MatPipeID = 327699,
    rwPDS_G3x_A4DSkinGem_MatPipeID = 327700,
    rwPDS_G3x_ADLClone_MatPipeID = 327701,
    rwPDS_G3x_ADLClone_AtmPipeID = 327702,
    rwPDS_G3x_OPLClone_MatPipeID = 327703,
    rwPDS_G3x_OPLClone_AtmPipeID = 327704,
    rwPDS_G3x_Team_MatPipeID = 327705,
    rwPDS_G3x_DupTeam_MatPipeID = 327706,
    rwPDS_G3x_GemTeam_MatPipeID = 327707,
    rwPDS_G3x_SkinTeam_MatPipeID = 327708,
    rwPDS_G3x_SkinDupTeam_MatPipeID = 327709,
    rwPDS_G3x_SkinGemTeam_MatPipeID = 327710,
    rwPDS_G3x_Team_AtmPipeID = 327711,
    rwPDS_G3x_SkinTeam_AtmPipeID = 327712,
    rwPDS_G3x_APLUva_MatPipeID = 327713,
    rwPDS_G3x_ADLUva_MatPipeID = 327714,
    rwPDS_G3x_A4DUva_MatPipeID = 327715,
    rwPDS_G3x_APLDupUva_MatPipeID = 327716,
    rwPDS_G3x_ADLDupUva_MatPipeID = 327717,
    rwPDS_G3x_A4DDupUva_MatPipeID = 327718,
    rwPDS_G3x_APLSkinUva_MatPipeID = 327719,
    rwPDS_G3x_ADLSkinUva_MatPipeID = 327720,
    rwPDS_G3x_A4DSkinUva_MatPipeID = 327721,
    rwPDS_G3x_APLSkDupUva_MatPipeID = 327722,
    rwPDS_G3x_ADLSkDupUva_MatPipeID = 327723,
    rwPDS_G3x_A4DSkDupUva_MatPipeID = 327724,
    rwPDS_G3xd_APL_MatPipeID = 327725,
    rwPDS_G3xd_ADL_MatPipeID = 327726,
    rwPDS_G3xd_A4D_MatPipeID = 327727,
    rwPDS_G3xd_APLDup_MatPipeID = 327728,
    rwPDS_G3xd_ADLDup_MatPipeID = 327729,
    rwPDS_G3xd_A4DDup_MatPipeID = 327730,
    rwPDS_G3xd_APLGem_MatPipeID = 327731,
    rwPDS_G3xd_ADLGem_MatPipeID = 327732,
    rwPDS_G3xd_A4DGem_MatPipeID = 327733,
    rwPDS_G3xd_APLUva_MatPipeID = 327734,
    rwPDS_G3xd_ADLUva_MatPipeID = 327735,
    rwPDS_G3xd_A4DUva_MatPipeID = 327736,
    rwPDS_G3xd_APLDupUva_MatPipeID = 327737,
    rwPDS_G3xd_ADLDupUva_MatPipeID = 327738,
    rwPDS_G3xd_A4DDupUva_MatPipeID = 327739,
    rwPDS_G3xd_APLSkin_MatPipeID = 327740,
    rwPDS_G3xd_ADLSkin_MatPipeID = 327741,
    rwPDS_G3xd_A4DSkin_MatPipeID = 327742,
    rwPDS_G3xd_APLSkinDup_MatPipeID = 327743,
    rwPDS_G3xd_ADLSkinDup_MatPipeID = 327744,
    rwPDS_G3xd_A4DSkinDup_MatPipeID = 327745,
    rwPDS_G3xd_APLSkinGem_MatPipeID = 327746,
    rwPDS_G3xd_ADLSkinGem_MatPipeID = 327747,
    rwPDS_G3xd_A4DSkinGem_MatPipeID = 327748,
    rwPDS_G3xd_APLSkinUva_MatPipeID = 327749,
    rwPDS_G3xd_ADLSkinUva_MatPipeID = 327750,
    rwPDS_G3xd_A4DSkinUva_MatPipeID = 327751,
    rwPDS_G3xd_APLSkDupUva_MatPipeID = 327752,
    rwPDS_G3xd_ADLSkDupUva_MatPipeID = 327753,
    rwPDS_G3xd_A4DSkDupUva_MatPipeID = 327754,
    rwPDS_VCL_Generic_AtmPipeID = 331776,
    rwPDS_VCL_ADLDot3_MatPipeID = 331777,
    rwPDS_VCL_APLDot3_MatPipeID = 331778,
    rwPDS_VCL_ADLSpec_MatPipeID = 331779,
    rwPDS_VCL_APLSpec_MatPipeID = 331780,
    rwPDS_VCL_Skin_AtmPipeID = 331781,
    rwPDS_VCL_ADLSkinDot3_MatPipeID = 331782,
    rwPDS_VCL_APLSkinDot3_MatPipeID = 331783,
    rwPDS_VCL_ADLSkinSpec_MatPipeID = 331784,
    rwPDS_VCL_APLSkinSpec_MatPipeID = 331785,
    rpPDSMAXPIPEID = 331786,
    rpPDSPIPEIDFORCEENUMSIZEINT = 2147483647,
};
class rxNodePS2AllPvtData {
    // total size: 0x0
};
class RxNodeDefinition {
    // total size: 0x40
public:
    char * name; // offset 0x0, size 0x4
    class RxNodeMethods nodeMethods; // offset 0x4, size 0x1C
    class RxIoSpec io; // offset 0x20, size 0x14
    unsigned int pipelineNodePrivateDataSize; // offset 0x34, size 0x4
    enum RxNodeDefEditable editable; // offset 0x38, size 0x4
    signed int InputPipesCnt; // offset 0x3C, size 0x4
};
class RxCluster {
    // total size: 0x1C
public:
    unsigned short flags; // offset 0x0, size 0x2
    unsigned short stride; // offset 0x2, size 0x2
    void * data; // offset 0x4, size 0x4
    void * currentData; // offset 0x8, size 0x4
    unsigned int numAlloced; // offset 0xC, size 0x4
    unsigned int numUsed; // offset 0x10, size 0x4
    class RxPipelineCluster * clusterRef; // offset 0x14, size 0x4
    unsigned int attributes; // offset 0x18, size 0x4
};
class RpPDSSkyMatCluster {
    // total size: 0x8
public:
    class RxClusterDefinition * definition; // offset 0x0, size 0x4
    unsigned int type; // offset 0x4, size 0x4
};
class RpMeshHeader {
    // total size: 0x10
public:
    unsigned int flags; // offset 0x0, size 0x4
    unsigned short numMeshes; // offset 0x4, size 0x2
    unsigned short serialNum; // offset 0x6, size 0x2
    unsigned int totalIndicesInMesh; // offset 0x8, size 0x4
    unsigned int firstMeshOffset; // offset 0xC, size 0x4
};
class RxPacket {
    // total size: 0x30
public:
    unsigned short flags; // offset 0x0, size 0x2
    unsigned short numClusters; // offset 0x2, size 0x2
    class RxPipeline * pipeline; // offset 0x4, size 0x4
    unsigned int * inputToClusterSlot; // offset 0x8, size 0x4
    unsigned int * slotsContinue; // offset 0xC, size 0x4
    class RxPipelineCluster * * slotClusterRefs; // offset 0x10, size 0x4
    class RxCluster clusters[1]; // offset 0x14, size 0x1C
};
class RwEngineOpenParams {
    // total size: 0x4
public:
    void * displayID; // offset 0x0, size 0x4
};
class RwLinkList {
    // total size: 0x8
public:
    class RwLLLink link; // offset 0x0, size 0x8
};
class rwPS2AllClusterInstanceInfo {
    // total size: 0x8
public:
    unsigned int attrib; // offset 0x0, size 0x4
    unsigned int stride; // offset 0x4, size 0x4
};
class RpPDSSkyMatPrimitive {
    // total size: 0x14
public:
    enum RwPrimitiveType type; // offset 0x0, size 0x4
    signed int clusterStride; // offset 0x4, size 0x4
    signed int vertexCount; // offset 0x8, size 0x4
    signed int primCount; // offset 0xC, size 0x4
    signed int vifOffset; // offset 0x10, size 0x4
};
enum RpMeshHeaderFlags {
    rpMESHHEADERTRISTRIP = 1,
    rpMESHHEADERTRIFAN = 2,
    rpMESHHEADERLINELIST = 4,
    rpMESHHEADERPOLYLINE = 8,
    rpMESHHEADERPOINTLIST = 16,
    rpMESHHEADERPRIMMASK = 255,
    rpMESHHEADERUNINDEXED = 256,
    rpMESHHEADERFLAGSFORCEENUMSIZEINT = 2147483647,
};

/*
    Compile unit: C:\SB\Core\p2\iSystem.cpp
    Producer: MW MIPS C Compiler
    Language: C++
    Code range: 0x001B9C50 -> 0x001B9C58
*/
// Range: 0x1B9C50 -> 0x1B9C58
void iSystem_GapTrackReport() {
    // Blocks
    /* anonymous block */ {
        // Range: 0x1B9C50 -> 0x1B9C58
    }
}

/*
    Compile unit: C:\SB\Core\p2\iSystem.cpp
    Producer: MW MIPS C Compiler
    Language: C++
    Code range: 0x001B9C60 -> 0x001B9DB0
*/
// Range: 0x1B9C60 -> 0x1B9DB0
void iLoadModule(char * moduleName /* r18 */, char * arguments /* r17 */) {
    // Blocks
    /* anonymous block */ {
        // Range: 0x1B9C60 -> 0x1B9DB0
